# -*- coding: utf-8 -*-

MENU = '\nДоступны следующие команды:\n\
        1. Получить погоду по Вашему местоположению.\n\
        2. Получить погоду в городе по названию города.\n\
        3. Получить историю Ваших запросов.\n\
        4. Удалить историю запросов.\n\
        5. Выйти из приложения.'

WELCOME = '\nДобро пожаловать!'

CLEAR_HISTORY = '\nИстория очищена.'

THANK_YOU = '\nСпасибо за использование нашего приложения.'

NOT_CORRECT_VALUE = '\nВведено некорректное значениe.'

SELECT_COMMAND = '\nВыберите номер команды: '

SELECT_CITY = '\nВведите название города, в котором хотите узнать погоду: '

TEXT_FOR_NUM_ERROR = '\nВведено некорректное значение. Введите целое число!'

TEXT_FOR_SIGN_ERROR = '\nВведено некорректное значение. Введите число неотрицательное число!'

SELECT_NUM_REQUESTS = '\nСколько последних запросов Вы хотите увидеть? Введите: '
